# SetOwnerHistoryHandle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..SetOwnerHistoryHandle Method
ExporterIFC Class See Also
---
Sets the handle to the IfcOwnerHistory for the file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetOwnerHistoryHandle(
	IFCAnyHandle ownerHistory
)
```

Visual Basic
---
```text
Public Sub SetOwnerHistoryHandle ( _
	ownerHistory As IFCAnyHandle _
)
```

Visual C++
---
```text
public:
void SetOwnerHistoryHandle(
	IFCAnyHandle^ ownerHistory
)
```

# ### Parameters
ownerHistory
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace